Income Tax/sample messages/retrievestatus_request_ir526.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/RetrieveStatus</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:RetrieveStatus xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnStatusRequestMsg>
                <ret1:RetrieveStatusRequestWrapper xmlns:ret1="https://services.ird.govt.nz/GWS/Returns/:types/RetrieveStatusRequest">
                    <rc:retrieveFormInfoRequest xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2" xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                        <cmn:softwareProviderData>
                            <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                            <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                            <cmn:softwareRelease>1.0</cmn:softwareRelease>
                        </cmn:softwareProviderData>
                        <cmn:identifier IdentifierValueType="ACCIRD">055786372</cmn:identifier>
                        <cmn:accountType>REB</cmn:accountType>
                        <rc:periodEndDate>2018-03-31</rc:periodEndDate>
                        <rc:majorFormType>REB</rc:majorFormType>
                    </rc:retrieveFormInfoRequest>
                </ret1:RetrieveStatusRequestWrapper>
            </ret:ReturnStatusRequestMsg>
        </ret:RetrieveStatus>
    </soap:Body>
</soap:Envelope>